---
kind: method
id: M:Autodesk.Revit.Exceptions.RevitServerModelAlreadyExistsException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/4e9bbe67-937b-21a8-b73a-4b7f702754bc.htm
---
# Autodesk.Revit.Exceptions.RevitServerModelAlreadyExistsException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.